Repository: ttkzw/nsd-manual-ja
Catalog: omegat/omegat-level1.tmx
Source language: en_us
Languages: ja

source: :command:`NSD` is a complete implementation of an authoritative DNS nameserver.
ja: :command:`NSD` は権威DNSサーバーの完全な実装です。

source: All the options can be specified in the configfile (:option:`-c` argument), except for the :option:`-v` and :option:`-h` options.
ja: :option:`-v` と :option:`-h` オプションを除いて、すべてのオプションは設定ファイル（ :option:`-c` 引数 ）で指定できます。

source: By default, :command:`NSD` will bind to all local interfaces available.
ja: デフォルトでは :command:`NSD` は利用できるすべてのローカルインターフェイスにバインドします。

source: Description
ja: 説明

source: If IPv6 is enabled when :command:`NSD` is compiled an IPv6 address can also be specified.
ja: command:`NSD`のコンパイル時にIPv6が有効になっていれば、IPv6アドレスも指定できます。

source: If this option is given more than once, :command:`NSD` will bind its UDP and TCP sockets to all the specified ip-addresses separately.
ja: このオプションを複数回与えると、 :command:`NSD` は指定されたすべてのIPアドレスにそれぞれUDPととTCPのソケットをバインドします。

source: Options
ja: オプション

source: Synopsis
ja: 概要

source: The database is created if it does not exist.
ja: databaseは存在しなければ作成されます。

source: Upon startup, :command:`NSD` will read the database specified with :option:`-f` ``database`` argument and put itself into background and answers queries on port 53 or a different port specified with :option:`-p` ``port`` option.
ja: 起動すると :command:`NSD` は :option:`-f` ``database`` 引数で指定されたデータベースを読み込み、バックグラウンドになり、53番ポートか :option:`-p` ``port`` オプションで指定された異なるポートでクエリーに応答します。

source: Use the :option:`-a` ``ip-address[@port]`` option to specify a single particular interface address to be bound.
ja: option:`-a` ``ip-address[@port]`` オプションを使用すると、バインドされる特定のインターフェースアドレスを指定できます。
